Config/Enums/СпособыВыгрузкиФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыВыгрузкиФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Каталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменСФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebСервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ФорматыВыгрузкиБухгалтерскойОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФорматыВыгрузкиБухгалтерскойОтчетности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеВнешнейОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОФайле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбОбработке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Справка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматУстарел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательОтчетности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможнаВыгрузкаПрисоединенныхФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоддерживаемыеСпособыОтправки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособОтправки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыгрузкиФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоддерживаемыеВидыОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодВидаОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНастройкиФормата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначенияХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбиратьИзСписка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокВыбораХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчаниюХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапоминатьЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/КонтрольныеСоотношения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КонтрольныеСоотношения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказателиТекущегоОтчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСоотношения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дополнительное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПояснения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрольногоСоотношения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидКонтрольногоСоотношения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщенияФЛК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НедопустимоеФЛК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИзменятьПриЗагрузкеКомплекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/ИнтеграцияОтчетностиГУИФормы1СОтчетностьКлиент/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура Выгрузить(Ссылка, УникальныйИдентификаторФормы = Неопределено) Экспорт 
	
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет") Тогда 
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура("ОтчетДляВыгрузки",Ссылка);
	ОткрытьФорму("Обработка.ВыгрузкаОтчетностиОрганизаций.Форма", ПараметрыФормы);
	
КонецПроцедуры

Процедура ОтправитьВКонтролирующийОрган(Ссылка, ВидКонтролирующегоОргана, КодКонтролирующегоОргана, СтандартнаяОбработка) Экспорт 
	
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет") Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ВидКонтролирующегоОргана <> ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФНС") Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ФорматВыгрузки = ПредопределенноеЗначение("Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности.ОтчетностьФНС_5_0");
	СпособВыгрузки = ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС"); 
	
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОтчетДляВыгрузки",Ссылка);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",Новый Структура);
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("ФорматВыгрузки",ФорматВыгрузки);
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("СпособВыгрузки",СпособВыгрузки);
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("ДополнительныеНастройкиФормата",Новый Структура);
	ПараметрыФормы.ЗначенияЗаполнения.ДополнительныеНастройкиФормата.Вставить("КодНалоговогоОргана",КодКонтролирующегоОргана);
	
	ОткрытьФорму("Обработка.ВыгрузкаОтчетностиОрганизаций.Форма", ПараметрыФормы);
	
КонецПроцедуры	

Процедура Печать(Ссылка, ИмяМакетаДляПечати, СтандартнаяОбработка) Экспорт 
	
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет") Тогда 
		Возврат;		
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.УниверсальныйРегламентированныйОтчет");
	ПараметрыФормы.Вставить("ИменаМакетов",	"ПечатьБланка");
	ПараметрыФормы.Вставить("ПараметрКоманды",	ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка));
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Ссылка",Ссылка);
	ПараметрыПечати.Вставить("ОписаниеКоманды", Новый Структура("Тип","ТекущийБланк"));
	ПараметрыПечати.Вставить("ПереопределитьПользовательскиеНастройкиКоличества",Истина);
	
	ПараметрыФормы.Вставить("ПараметрыПечати",	ПараметрыПечати);
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы);
		
КонецПроцедуры	

Процедура ПоказатьСостояниеОтправкиОтчета(Ссылка, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Ссылка) <>  Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет") Тогда 
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Этап","Начало");
	ДополнительныеПараметры.Вставить("Ссылка",Ссылка);

	
	Оповещения = Новый ОписаниеОповещения("ПоказатьСостояниеОтправкиОтчетаВнутр", ЭтотОбъект, ДополнительныеПараметры);
 	ВыполнитьОбработкуОповещения(Оповещения);
	
КонецПроцедуры	

Процедура ОповеститьОбизмененииЭлДокумента(Ссылка) Экспорт 
	
	МассивСсылок = ИнтеграцияОтчетностиГУИФормы1СОтчетностьВызовСервера.ПолучитьСоставЭлДокумента(Ссылка);
	ИнтеграцияОтчетностиГУИФормы1СОтчетностьВызовСервера.ЗаписатьДанныеОтчетовВЖурнал(МассивСсылок, Ложь);
	Для Каждого Отчет из МассивСсылок Цикл 
		
		Оповестить("Запись_УниверсальныйРегламентированныйОтчет", , Отчет);
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ПодробнееОбОчете(Ссылка, ИмяФормыПодробнееОбОтчете, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ВидыОтчетов") Тогда 
		
		СтандартнаяОбработка = Ложь;
		Сообщение = НСтр("ru = 'Подробное описание данного отчета не предусмотрено'");
		ПоказатьПредупреждение(,Сообщение);
		
	КонецЕсли;
	
КонецПроцедуры

// Отбирает среди выделенных в списке отчетов универсальные регламентированные отчеты, возвращает массив отобранных отчетов.
//
// Параметры:
//	Форма   - Форма, из которой вызвана команда.
//
// Возвращаемое значение:
//	МассивДляПроверки - Массив со значениями ДокументСсылка.УниверсальныйРегламентированныйОтчет
//
Функция ПолучитьМассивВыделенныхРегОтчетов(Форма)
	
	МассивДляУниверсальныеРегОтчеты = Новый Массив;
	Для Каждого ВыделенныйОтчет Из Форма.Элементы.Отчеты.ВыделенныеСтроки Цикл
		ОтчетСсылка = Форма.Элементы.Отчеты.ДанныеСтроки(ВыделенныйОтчет).РегламентированныйОтчет;
		Если ТипЗнч(ОтчетСсылка) = Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет") Тогда 
			МассивДляУниверсальныеРегОтчеты.Добавить(ОтчетСсылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивДляУниверсальныеРегОтчеты;
	
КонецФункции

// Процедура выполняет команды проверки регламентированной отчетности с заданными параметрами.
//
// Параметры:
//   Форма   - Форма, из которой вызвана команда.
//   ВидКС	 - Строка ("ВФ","МФ",""), определяет способ проверки - только внутриформенные, только межформенные
//				или все контрольные соотношения (если параметр не заполнен).
//   ТолькоОшибочные		- Булево, определяет необходимость отображения только ошибочных
//							или всех контольных соотношений.
//
Процедура ВыполнитьКомандуПроверкиКС(Форма, ВидКС = "", ТолькоОшибочные)
	
	МассивДляПроверки = ПолучитьМассивВыделенныхРегОтчетов(Форма);
	
	Если МассивДляПроверки.Количество() > 0 Тогда
		
		ПараметрыВыполненияКоманды = Новый Структура;
		ПараметрыВыполненияКоманды.Вставить("Источник", Форма);
		ПараметрыВыполненияКоманды.Вставить("НавигационнаяСсылка", "");
		ПараметрыВыполненияКоманды.Вставить("Окно", Неопределено);
		ПараметрыВыполненияКоманды.Вставить("Уникальность", Ложь);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("СтрокиОтчетов",МассивДляПроверки);
		ДополнительныеПараметры.Вставить("ВидКС",ВидКС);
		ДополнительныеПараметры.Вставить("ТолькоОшибочные",ТолькоОшибочные);
		ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды",ПараметрыВыполненияКоманды);
		
		КонтрольныеСоотношенияКлиент.ПроверитьОтчетыКлиентВнутр(ДополнительныеПараметры);
	Иначе
		Сообщение = НСтр("ru = 'Проверка контрольных соотношений предусмотрена только для бухгалтерской регламентированной отчетности'");
		ПоказатьПредупреждение(,Сообщение);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет назначаемую команду формы.
//
// Параметры:
//   Форма   - Форма, из которой вызвана команда.
//   Команда - КомандаФормы, назначенная команда формы.
//
Процедура ВыполнитьНазначаемуюКомандуНаКлиенте(Форма, Команда) Экспорт
	
	Если Команда.Имя = "ГрупповаяВыгрузка" ИЛИ Команда.Имя = "ОбменСводОтчетовСервис" Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("СпособОткрытия","1CОтчетность"+Команда.Имя);
		ПараметрыФормы.Вставить("НачалоПериода",Форма.НачалоПериода);
		ПараметрыФормы.Вставить("КонецПериода",Форма.КонецПериода);
		ПараметрыФормы.Вставить("ОтборОрганизация",Форма.Организация);
		
		ОткрытьФорму("Документ.УниверсальныйРегламентированныйОтчет.ФормаСписка", ПараметрыФормы);
		
		// Команды страницы настроек отчетности
	ИначеЕсли Команда.Имя = "ЗагрузитьКомплектБухОтчетности" Тогда
		ОткрытьФорму("Обработка.ИмпортКейса.Форма.Форма");
	ИначеЕсли Команда.Имя = "ЗагрузитьКомплектыБухОтчетностиСоСтраницыПоддержки" Тогда	
		ОткрытьФорму("Обработка.ИмпортКейса.Форма.ФормаЗагрузкиКомплектовСоСтраницыПоддержки");
	ИначеЕсли Команда.Имя = "ЗагрузитьКомплектыБухОтчетностиИзПоставляемыхДанных" Тогда	
		ОткрытьФорму("Обработка.ИмпортКейса.Форма.ФормаЗагрузкиКомплектовИзПоставляемыхДанных");
	ИначеЕсли Команда.Имя = "УдалениеДублейБухОтчетности" Тогда
		ОткрытьФорму("Обработка.УдалениеДублейРегламентированнойОтчетности.Форма.Форма");	
	ИначеЕсли Команда.Имя = "ОтчетПоВерсиямКомплектов" Тогда
		ПараметрыФормыОтчета = Новый Структура;
		ПараметрыФормыОтчета.Вставить("СформироватьПриОткрытии",Истина);
		ОткрытьФорму("Отчет.ОтчетПоВерсиямКомплектов.Форма", ПараметрыФормыОтчета, Форма);
	ИначеЕсли Команда.Имя = "НастройкаБухОтчетности" Тогда
		ОткрытьФорму("ОбщаяФорма.НастройкаРегламентированнойБухОтчетности");
	ИначеЕсли Команда.Имя = "СправочникВидыБухОтчетности" Тогда
		ОткрытьФорму("Справочник.ВидыОтчетов.ФормаСписка");
	ИначеЕсли Команда.Имя = "СправочникОтчетныеПериоды" Тогда
		ОткрытьФорму("Справочник.Периоды.ФормаСписка");
	ИначеЕсли Команда.Имя = "СправочникКонтрольныеСоотношения" Тогда
		ОткрытьФорму("Справочник.КонтрольныеСоотношения.ФормаСписка");
	ИначеЕсли Команда.Имя = "СправочникФорматыВыгрузкиБух" Тогда
		ОткрытьФорму("Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности.ФормаСписка");
		
		//Старый интерфейс регламентированной отчетности
	ИначеЕсли Команда.Имя = "НалоговаяИСтатистическаяОтчетность" Тогда
		ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.УправлениеОтчетностью");
	ИначеЕсли Команда.Имя = "БухгалтерскаяОтчетность" Тогда
		ОткрытьФорму("Документ.УниверсальныйРегламентированныйОтчет.ФормаСписка");
		
		//Календарь бухгалтера	
	ИначеЕсли Команда.Имя = "КомандаКалендарьБухгалтера" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДатаНачалаПериодаОтчета", Форма.НачалоПериода);
		ПараметрыФормы.Вставить("ДатаКонцаПериодаОтчета", Форма.КонецПериода);
		ПараметрыФормы.Вставить("Периодичность", Истина);
		ПараметрыФормы.Вставить("Организация", Форма.Организация);
				
		ОткрытьФорму("Обработка.КалендарьБухгалтера.Форма.ФормаКалендаря", ПараметрыФормы, Форма);
		
		
		// Контрольные соотношения
	ИначеЕсли Команда.Имя = "ВнутриформенныйКонтроль" Тогда
		ВыполнитьКомандуПроверкиКС(Форма, "ВФ", Истина);
	ИначеЕсли Команда.Имя = "МежформенныйКонтроль" Тогда
		ВыполнитьКомандуПроверкиКС(Форма, "МФ", Истина);
	ИначеЕсли Команда.Имя = "ПолнаяПроверка" Тогда
		ВыполнитьКомандуПроверкиКС(Форма, "", Истина);
	ИначеЕсли Команда.Имя = "ПоказатьВсеКС" Тогда	
		ВыполнитьКомандуПроверкиКС(Форма, "", Ложь);
		
		//Сравнение с данными заполнения
	ИначеЕсли Команда.Имя = "СравнитьСДаннымиАвтозаполнения" Тогда
		
		ТекДанные = Форма.Элементы.Отчеты.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ОтчетСсылка = ТекДанные.РегламентированныйОтчет;
		Если ТипЗнч(ОтчетСсылка) = Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет") Тогда
			
			Если ТекДанные.ЕстьДанныеЗаполнения = Ложь Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Для данного отчета отсутствуют сохраненные данные автозаполнения.'"));
				Возврат;	
			КонецЕсли;
			
			БюджетнаяОтчетностьКлиент.СравнитьСДаннымиАвтозаполнения(Форма,ОтчетСсылка,Форма.УникальныйИдентификатор,Неопределено);
		Иначе
			ТекСообщение = НСтр("ru = 'Сравнение с данными автозаполнения предусмотрено только для бухгалтерской регламентированной отчетности'");
			ПоказатьПредупреждение(,ТекСообщение);

		КонецЕсли;
		
		//Открытие отчета в Excel
	ИначеЕсли Команда.Имя = "ОткрытьВExcel" Тогда
		ТекДанные = Форма.Элементы.Отчеты.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		МассивВыделенныхСтрок = Форма.Элементы.Отчеты.ВыделенныеСтроки;
		МассивОтчетов = Новый Массив;
		
		ТипРегОтчет = Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет");
		Для Каждого ЭлМас Из МассивВыделенныхСтрок Цикл
			ТекДанныеСтроки = Форма.Элементы.Отчеты.ДанныеСтроки(ЭлМас);
			Если ТипЗнч(ТекДанныеСтроки.РегламентированныйОтчет) = ТипРегОтчет Тогда
				МассивОтчетов.Добавить(ТекДанныеСтроки.РегламентированныйОтчет);
			КонецЕсли;
		КонецЦикла;		
		
		Если МассивОтчетов.Количество()>1 Тогда
			//выгрузка в архив
			ДлительнаяОперация = ИнтеграцияОтчетностиГУИФормы1СОтчетностьВызовСервера.ПолучитьАрхивОтчетов(МассивОтчетов,Форма.УникальныйИдентификатор);
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
			ПараметрыОжидания.ВыводитьСообщения = Истина;
			ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
			ОповещениеПроверитьВыполнение = Новый ОписаниеОповещения("ПослеСохраненияОтчетовВАрхив", ЭтотОбъект);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеПроверитьВыполнение, ПараметрыОжидания);
		
		ИначеЕсли МассивОтчетов.Количество() = 1 Тогда
			ОтчетСсылка = МассивОтчетов[0];
			АдресФайлаExcel = ПоместитьВоВременноеХранилище("", Форма.УникальныйИдентификатор);
			ИнтеграцияОтчетностиГУИФормы1СОтчетностьВызовСервера.ОткрытиеОтчетаВExcel(ОтчетСсылка,АдресФайлаExcel);
			
			#Если ВебКлиент Тогда
				ПолучитьФайл(АдресФайлаExcel, "Report.xlsx", Истина);
			#Иначе
				ИмяФайлаExcel = ПолучитьИмяВременногоФайла("xlsx");
				ПолучитьФайл(АдресФайлаExcel, ИмяФайлаExcel, Ложь);
				
				Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
				НачатьЗапускПриложения(Оповещение, ИмяФайлаExcel);
			#КонецЕсли	
			
		Иначе
			ТекСообщение = НСтр("ru = 'Открытие отчета в Excel предусмотрено только для бухгалтерской регламентированной отчетности'");
			ПоказатьПредупреждение(,ТекСообщение);
		КонецЕсли;
		
		//информирование о новых версиях комплекта
	ИначеЕсли Команда.Имя = "НоваяВерсияКомплектаДекорацияНадписьЗакрыть" Тогда
		
		ЭлементЗакрыть = Форма.Элементы.Найти("НоваяВерсияКомплектаДекорацияНадписьЗакрыть");
		Если ЭлементЗакрыть <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,ЭлементЗакрыть.Родитель.Имя,"Видимость", Ложь);
		КонецЕсли;
		
	ИначеЕсли Команда.Имя = "НоваяВерсияКомплектаДекорацияНадписьЗагрузитьЛокально" Тогда
		
		ОткрытьФорму("Обработка.ИмпортКейса.Форма.ФормаЗагрузкиКомплектовСоСтраницыПоддержки",,Форма);	
		
	ИначеЕсли Команда.Имя = "НоваяВерсияКомплектаДекорацияНадписьЗагрузитьОблако" Тогда
		
		ОткрытьФорму("Обработка.ИмпортКейса.Форма.ФормаЗагрузкиКомплектовИзПоставляемыхДанных",,Форма);
		
		// Информационные ссылки
	ИначеЕсли Команда.Имя = "СсылкаВсеИнформационныеСсылки" Тогда
		БюджетнаяОтчетностьКлиентПереопределяемый.НажатиеНаСсылкуВсеИнформационныеСсылки(Форма.ИмяФормы); 
		
	ИначеЕсли Найти(ВРег(Команда.Имя), ВРег("ЭлементСсылки")) = 1 Тогда
		Гиперссылка = Форма.ИнформационныеСсылки.НайтиПоЗначению(Команда.Имя);
		Если Гиперссылка <> Неопределено Тогда
			ПерейтиПоНавигационнойСсылке(Гиперссылка.Представление);
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияОтчетовВАрхив(Результат,ДополнительныеПараметры) Экспорт
	
	Попытка
		
		ТекДата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
		ПолучитьФайл(Результат.АдресРезультата, "Reports "+ТекДата+".zip", Истина);

	Исключение
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапускПриложения(Результат, ДополнительныйПараметр) Экспорт
	Возврат;
КонецПроцедуры


//Процедура переопределяет имя формы выбора периода для установки отбора в форме "1С Отчетность"
//
// Параметры:
//  ПолноеИмяФормыВыбораПериода  - Строка - Полный путь к форме выбора периода.
//
// Пример:
//  ПолноеИмяФормыВыбораПериода = "ОбщаяФорма.ВыборПроизвольногоПериода";
//
Процедура ФормаРегламентированнойОтчетности_ИмяФормыВыбораПериода(ПолноеИмяФормыВыбораПериода) Экспорт
	
	ПолноеИмяФормыВыбораПериода = "Справочник.Периоды.Форма.ФормаВыбора1СОтчетность";
	
КонецПроцедуры	

// Процедура переопределяет имя и параметры открытия формы выбора отчета для установки отбора в форме "1С Отчетность".
//
// Параметры:
//  ПолноеИмяФормыВыбораВидаОтчета - Строка - Полный путь к форме выбора вида отчета.
//  ПараметрыФормыВыбораВидаОтчета - Структура - Параметры открытия формы выбора вида отчета.
//
// Пример:
//  ПолноеИмяФормыВыбораВидаОтчета = "ОбщаяФорма.ФормаПодбораЗначенийВСписок";
//
Процедура ФормаРегламентированнойОтчетности_ОпределениеФормыВыбораВидаОтчета(ПолноеИмяФормыВыбораВидаОтчета,
																			 ПараметрыФормыВыбораВидаОтчета) Экспорт
	
	ПолноеИмяФормыВыбораВидаОтчета = "ОбщаяФорма.ФормаОтбораВидовОтчетов";
	
КонецПроцедуры

// ПРОГРАММНЫЙ ИНТЕРФЕЙС
////////////////////////////////////////////////////////////////////////////////
// Служебные
	

Процедура ПоказатьСостояниеОтправкиОтчетаВнутр(Результат, ДополнительныеПараметры) Экспорт 
	
	Если ДополнительныеПараметры.Этап = "Начало" Тогда 
		Ссылка = ДополнительныеПараметры.Ссылка;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Этап","1");
		ДополнительныеПараметры.Вставить("Ссылка",Ссылка);
		ДополнительныеПараметры.Вставить("ДанныеОтчета");
		ДополнительныеПараметры.Вставить("ДокументОтправки");
		
		
		Оповещения = Новый ОписаниеОповещения("ПоказатьСостояниеОтправкиОтчетаВнутр", ЭтотОбъект, ДополнительныеПараметры);
		ВыполнитьОбработкуОповещения(Оповещения);
		Возврат;
		
	КонецЕсли;
	
	//Начало
	////////////////////////////////////////////////////////////////////////////////
	// Этап 1
	
	Если ДополнительныеПараметры.Этап = "1" Тогда 
		
		ДанныеОтчетов = ИнтеграцияОтчетностиГУИФормы1СОтчетностьВызовСервера.ПолучитьДанныеОтчетов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныеПараметры.Ссылка));
		ВозможныеДокументыОтпраки = ИнтеграцияОтчетностиГУИФормы1СОтчетностьВызовСервера.ПолучитьЭлДокПоОтчету(ДополнительныеПараметры.Ссылка);
		
		Если Не ЗначениеЗаполнено(ДанныеОтчетов) Тогда 
			
			Шаблон = НСтр(
			"ru = 'Не удалось получить данные отчета ""%1"". '");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ДополнительныеПараметры.Ссылка);
			ПоказатьПредупреждение(,Сообщение);
			Возврат
		Иначе 
			ДанныеОтчета = ДанныеОтчетов[0];
		КонецЕсли;
		
		Если ДанныеОтчета.НеОтправляетсяВКонтролирующийОрган Тогда
			
			Шаблон = НСтр(
			"ru = '""%1"" не сдается в электронном виде'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ДанныеОтчета.НаименованиеОтчета);
			ПоказатьПредупреждение(,Сообщение);
			Возврат;
			
		КонецЕсли;
		
		Если ДанныеОтчета.СостояниеСдачиОтчетности = ПредопределенноеЗначение("Перечисление.СостояниеСдачиОтчетности.ДокументооборотНеНачат") Тогда
			
			Сообщение = НСтр(
			"ru = 'Просмотр подробной информации о состоянии отчета 
			|возможен только после его отправки'");
			ПоказатьПредупреждение(,Сообщение);
			Возврат;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВозможныеДокументыОтпраки) Тогда 
			
			Шаблон = НСтр(
			"ru = 'Не удалось найти документ ""Бухгалтерский отчет (электронный документ)"" которым отправлялся отчет ""%1"". '");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ДополнительныеПараметры.Ссылка);
			ПоказатьПредупреждение(,Сообщение);
			Возврат;

			
		КонецЕсли;	
		
		ДополнительныеПараметры.ДанныеОтчета = ДанныеОтчета;
		
		Если ВозможныеДокументыОтпраки.количество() > 1 Тогда 
			
			
			Шаблон = НСтр(
			"ru = 'Найдено несколько документов ""Бухгалтерский отчет (электронный документ)"" для отчета ""%1"".
			|Информацию по какому из них нужно показать?'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ДополнительныеПараметры.Ссылка);
			
			СписокКнопок = Новый СписокЗначений;
			Для Каждого ВозможныйВариант из ВозможныеДокументыОтпраки Цикл 
				СписокКнопок.Добавить(ВозможныйВариант, СтрЗаменить(Строка(ВозможныйВариант),"Бухгалтерский отчет (электронный документ) ",""));
			КонецЦикла;	
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
			
			
			ДополнительныеПараметры.Этап = "2";
			
			Оповещения = Новый ОписаниеОповещения("ПоказатьСостояниеОтправкиОтчетаВнутр", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(Оповещения, Сообщение, СписокКнопок);
			Возврат;
			
		Иначе 
			
	       	ДополнительныеПараметры.Этап = "3";
			
			ДополнительныеПараметры.ДокументОтправки = ВозможныеДокументыОтпраки[0];
			
			Оповещения = Новый ОписаниеОповещения("ПоказатьСостояниеОтправкиОтчетаВнутр", ЭтотОбъект, ДополнительныеПараметры);
			ВыполнитьОбработкуОповещения(Оповещения);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;	

	// Этап 1
	////////////////////////////////////////////////////////////////////////////////
	// Этап 2

	Если ДополнительныеПараметры.Этап = "2" Тогда
		
		Если ТипЗнч(Результат) <> Тип("ДокументСсылка.ЭлектронныйДокументБухгалтерскийОтчет") Тогда 
			Возврат;
		КонецЕсли;	
		
		ДополнительныеПараметры.Этап = "3";
		
		ДополнительныеПараметры.ДокументОтправки = Результат;
		
		Оповещения = Новый ОписаниеОповещения("ПоказатьСостояниеОтправкиОтчетаВнутр", ЭтотОбъект, ДополнительныеПараметры);
		ВыполнитьОбработкуОповещения(Оповещения);
		Возврат;
		
	КонецЕсли;	
	
	// Этап 2
	////////////////////////////////////////////////////////////////////////////////
	// Этап 3
	
	Если ДополнительныеПараметры.Этап = "3" Тогда
		
		ДополнительныеПараметры.Этап = "4";
		
		Оповещения = Новый ОписаниеОповещения("ПоказатьСостояниеОтправкиОтчетаВнутр", ЭтотОбъект, ДополнительныеПараметры);
		ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(Оповещения);
		Возврат;	
		
	КонецЕсли;	
	
	// Этап 3
	////////////////////////////////////////////////////////////////////////////////
	// Этап 4

	
	Если ДополнительныеПараметры.Этап = "4" Тогда
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда 
			ПоказатьПредупреждение(,Результат.ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		КонтекстЭДО = Результат.КонтекстЭДО;
		КонтекстЭДО.ПоказатьФормуСтатусовОтправки(ДополнительныеПараметры.ДокументОтправки);	
		
	КонецЕсли;
	
	
КонецПроцедуры
